export const blogData = `こんにちは、monicaです。
この度、ウルシステムズ株式会社さん主催の[UTE-1](https://uteone.jp/)というイベントに参加してきました。
UTE-1とは、学生を対象にしたGoアプリケーション開発のビジネスタスク力・パフォーマンスチューニング力を競うコンテストです。
ISUCONの学生向け、Goに特化したバージョンといった感じです。

## 私たちについて

### なぜUTE-1に参加したのか

私のいる某大学で昨年度の夏に新しく「Web研究会」を立ち上げました。
(正式には競プロサークルMaximumの子サークルという立ち位置です。)

未経験の学生がWebアプリケーション開発の基礎を学べる基盤を作りたいという目的で実務経験のある私(monica)と競プロサークルの代表(Asa)の２人で立ち上げました。
ISUCONに参加することを目標にして人材育成に励んでいたところ、ウルシステムズさんからUTE-1の招待をいただき、せっかくの機会なので参加してみようということになりました。

### メンバー構成

- 私（monica）: フルスタックエンジニア、Go初心者、実務経験者
- Asa: フルスタックエンジニア、Go初心者、Atcoderがつよいひと
- Through: Web未経験、一年前に競プロでプログラミングデビューをしたひと
- Kasa: Web未経験、一年前に競プロでプログラミングデビューをしたひと

### 事前準備

学期末が終わった2/9から毎晩3時間ほどあつまり、ISUCONの過去問をといて主に「パフォーマンスチューニング」について勉強しました[^1]。
本番が2/25日なので15日間と約二週間という短い期間で基礎をがん詰めするということになりました。

## 本番

UTE-1運営の意向により、問題内容やコードは公開しないとのことなので、ここでは私たちの取り組みについてのみ記載します。

### 流れ

|時間|内容|
|:--|:--|
|10:00|開会式|
|10:30|リポジトリの配布、本番環境の公開、開発スタート|
|17:00|本番環境の停止、開発終了、最終採点スタート|
|17:40|最終採点終了、結果発表、閉会式|
|18:00|終了|
|...|(優勝者だけが参加できる領域)|

### 開発環境

- リポジトリ: 事前にUTE-1のGithub Organizationへ招待され、各チームに1つ配布されます
- 環境:
  - ローカル: docker, docker-compose, devcontainer
  - 本番: k8s, GKE(GCP)
  - CI/CD: Github Actions
  - DB: MongoDB, MySQL

### チームの役割分担

|メンバー|役割|
|:--|:--|
|Through, Kasa| バグ洗い出し、Issue立て（仕様書を熟読してドメインリーダーになってもらう目的）|
|自分, Asa| Issue解決、バグ修正|

なるべく初心者の2人の開発負担を軽くしたいということで、このような役割分担をしました。

### バグの発見と修正

私たちはIssue Templateを事前に用意して、初心者でもGitFlowがうまく運用できるようにしておいたため、バグの発見から共有、タスクマネジメントはとてもスムーズでした。

![issue template](/images/117a84653f69a7/issue_template.png)

まずは、仕様書を読み、バグを洗い出しました。想定外[^2]のバグFixタスクなのでとても苦戦しました。
特にIO(Req,Res)のバリデーションやクエリ修正等のシンプルなものが多かったですが、トランザクション系のアプリ故になかなか読み慣れない書き方が多く、発見と修正に時間がかかりました。

![issue list](/images/117a84653f69a7/issue_list.png)

### パフォーマンスチューニング

[^1]のとおり、パフォーマンススコアを上げるためには、先にある程度のバグを修正する必要がありました。
自分たちのチームはバグで想定以上につまづいてしまったのでほとんどパフォーマンスチューニングに取り組めませんでした。
MongoDBやMysqlへのスキーマはSQLで定義せず、Go上のマイグレーション（？）から定義していました、しかしISUCON対策で未経験二人にSQLを教えていたため本番では詰んでいました...
（先見の明があれば...もっと実務的なことをやっておけばよかった...と反省しています）

## 結果

初動はかなり順調で、開始二時間半の時点で5/30位にランクインしました。
![result](/images/117a84653f69a7/result_max.png)

しかし、バグ修正と仕様書の解釈ミスが重なりに重なった結果、中盤以降のスコアが停滞してしまい（同じバグで3時間ほど悩んでしまいました...）、最終的には22/30位にとどまる結果となりました。
![result](/images/117a84653f69a7/result_final.png)

## 反省

結果を踏まえて当日中に感想会という形で振り返りを行いました。

- 仕様書の解釈ミスが目立った
  - 仕様書を読む担当とバグ修正担当で疎通がうまく取れず、解釈ミスがバグ改善の時間にも影響してしまったので、**ビジネスタスク力**や**読解力**がより重要になると感じました。
- バグ修正の時間がかかった
  - 適宜**テスト**を書くべきだった（時間的な焦りからテストを書くという選択肢に踏み出せなかった）
  - ローカル開発環境の立ち上げで詰まってしまった（dockerの立ち上げで30分ほどかかり、さらにローカルでの改修後反映の方法がわからず、結局本番でログを見ながら修正した）
  - ベンチマークをより積極的に使うべきだった（点数からできる問題推測やログを見ることも重要だと感じた）
- 人的リソースのマネジメント
  - 30分ごとにチーム全員へ進捗を聞くという形で被っているタスクをしていないか、同じ問題に詰まりすぎていないかを確認していたつもりだったが、結局口頭での毎回の確認が目立ち、時間がかかってしまった
  - 例えばIssue Flowを強固にしたり、リアルタイムタスク共有ツールを使ったりするなど、チーム全体のコミュニケーションをよりスムーズにする方法があると感じた
- 十分な事前学習ができていなかった
  - これは参加が決まって学期末が終わってからの対策で、効果があまり出なかった
  - 次回(ISUCONに参加する予定)はより長めの対策と過去問分析をしたい

## まとめ

ISUCONに参加して、自分とサークルとしての課題を見つけることができました。
<!-- textlint-disable -->
今回見つけた課題を今後のサークルの講義で活かし、より実践的な講義をしていきたいと思います。
<!-- textlint-enable -->

さいごに運営の方々、チームの皆さん、応援してくれた皆さん、ありがとうございました！

[^1]: ISUCONの過去問を事前勉強として解いていましたが、問題の仕様上Performanceチューニングの問題へ取り組む前にバグを見つけ修正しないとならなかったため、結局あまり役に立ちませんでした..。
[^2]: 見つけたバグを可能な限り修正していくものだと当時勘違いしていましたが、実際はベンチマーカーが吐いたバグ修正リストを元に修正していくものでした。気づくのに時間がかかったので、初動でベンチマークを走らせてみたチームほど点数が高かったと感じています。`

export const blogsData = [
  {
    content:
      '# コンテナ技術の基礎を学ぼう\n\nコンテナ技術は、近年注目を集めているアプリケーションのデプロイ技術です。DockerやKubernetesといったコンテナオーケストレーションツールを利用することで、アプリケーションのデプロイがより簡単になります。\n\n## コンテナとは？\n\nコンテナは、アプリケーションを動かすために必要なライブラリやツール類を一緒にパッケージ化したものです。このようにパッケージ化することで、アプリケーションを実行する環境が揃い、どの環境でも同じようにアプリケーションを動かすことができます。\n\n## Dockerとは？\n\nDockerは、コンテナ技術を実現するためのオープンソースのプラットフォームです。Dockerを利用することで、アプリケーションやその依存関係を一つのイメージにまとめ、そのイメージを使ってコンテナを起動することができます。\n\n## Kubernetesとは？\n\nKubernetesは、Dockerなどのコンテナ技術を利用して、アプリケーションのデプロイや管理を自動化するオープンソースのツールです。Kubernetesは、コンテナのスケーリングやロードバランシングなどを自動で行い、アプリケーションの安定稼働を支援します。\n\nコンテナ技術を学ぶことで、アプリケーションのデプロイや管理がより簡単になります。DockerやKubernetesといったツールを利用することで、アプリケーションをよりスムーズに運用することができます。',
    createdAt: '2022-01-01T00:00:00Z',
    description:
      'DockerやKubernetesなど、コンテナ技術の基礎を解説します。コンテナを活用することで、アプリケーションのデプロイが楽になります。',
    id: '1',
    slug: 'learn-container-technology',
    tags: ['コンテナ', 'Docker', 'Kubernetes'],
    title: 'コンテナ技術の基礎を学ぼう',
  },
  {
    createdAt: '2022-01-02T12:30:00Z',
    description: '機械学習について初心者でも理解できるように、基本的な用語やアルゴリズムについて解説します。',
    id: '2',
    slug: 'learn-machine-learning',
    tags: ['機械学習', '人工知能'],
    title: '初心者でも分かる機械学習の入門',
  },
  {
    createdAt: '2022-01-03T08:00:00Z',
    description: 'リアクティブプログラミングにおける、ストリーミングデータや非同期処理の基礎的な考え方を解説します。',
    id: '3',
    slug: 'reactive-programming',
    tags: ['リアクティブプログラミング', '非同期処理'],
    title: 'リアクティブプログラミングの基本的な考え方',
  },
  {
    createdAt: '2022-01-04T10:15:00Z',
    description:
      'サーバレスアーキテクチャを利用するメリットやデメリットについて解説します。サーバレスアーキテクチャを採用することで、コスト削減やスケーラビリティの向上が期待できます。',
    id: '4',
    slug: 'serverless-architecture',
    tags: ['サーバレスアーキテクチャ', 'クラウド'],
    title: 'サーバレスアーキテクチャの利点と欠点',
  },
  {
    createdAt: '2022-01-05T16:45:00Z',
    description:
      'JavaScriptの基礎的な文法や、DOM操作、Ajax通信などについて解説します。Web開発において、JavaScriptは欠かせない言語です。',
    id: '5',
    slug: 'learn-javascript',
    tags: ['JavaScript', 'Web開発'],
    title: 'JavaScriptの基礎をマスターしよう',
  },
  {
    createdAt: '2022-01-06T14:00:00Z',
    description:
      'DevOps文化の導入方法について解説し、その効果についても考察します。DevOps文化の導入により、開発チームと運用チームのコミュニケーションが改善され、開発速度や品質の向上が期待できます。',
    id: '6',
    slug: 'devops',
    tags: ['DevOps', 'アジャイル開発'],
    title: 'DevOps文化の導入方法とその効果',
  },
  {
    createdAt: '2022-01-07T09:30:00Z',
    description:
      'Webアプリケーションのセキュリティ対策について、基本的な手法から実践的な方法まで解説します。Webアプリケーションのセキュリティ対策は、重要な課題です。',
    id: '7',
    slug: 'web-application-security',
    tags: ['セキュリティ', 'Webアプリケーション'],
    title: 'Webアプリケーションのセキュリティ対策について',
  },
  {
    createdAt: '2022-01-08T11:45:00Z',
    description:
      'データベースの基本的な概念や、データベース設計のポイントについて解説します。データベースは、情報を管理する上で欠かせない技術です。',
    id: '8',
    slug: 'database',
    tags: ['データベース', '情報管理'],
    title: 'データベースの基本と設計のポイント',
  },
  {
    createdAt: '2022-01-09T13:00:00Z',
    description:
      'クラウドコンピューティングの基本的な概念や、利用方法について解説します。クラウドコンピューティングを利用することで、インフラストラクチャの運用負荷を軽減できます。',
    id: '9',
    slug: 'cloud-computing',
    tags: ['クラウドコンピューティング', 'インフラストラクチャ'],
    title: 'クラウドコンピューティングの基本と利用方法',
  },
  {
    createdAt: '2022-01-10T15:30:00Z',
    description:
      'コードレビューの効果的な方法と、ツールについて解説します。コードレビューを行うことで、開発者のスキルアップや品質の向上が期待できます。',
    id: '10',
    slug: 'code-review',
    tags: ['コードレビュー', '開発者向け'],
    title: 'コードレビューの効果的な方法とツール',
  },
  {
    createdAt: '2022-03-01',
    description:
      '機械学習は、人工知能の分野の一部であり、コンピュータが人間と同じように学習することができるようにするための技術です。',
    id: '11',
    slug: 'introduction-to-machine-learning',
    tags: ['機械学習', '人工知能'],
    title: '機械学習の概要',
  },
  {
    createdAt: '2022-02-28',
    description:
      'Reactは、Facebookが開発したJavaScriptのライブラリであり、Webアプリケーションを構築するための人気の高いツールです。',
    id: '12',
    slug: 'getting-started-with-react',
    tags: ['React', 'JavaScript', 'Web開発'],
    title: 'Reactのはじめかた',
  },
  {
    createdAt: '2022-02-27',
    description: 'データ構造は、データを効率的に処理するための方法を提供する重要なコンピュータサイエンスの分野です。',
    id: '13',
    slug: 'the-basics-of-data-structures',
    tags: ['データ構造', 'アルゴリズム', 'コンピュータサイエンス'],
    title: 'データ構造の基本',
  },
  {
    createdAt: '2022-02-25',
    description:
      'Dockerは、コンテナ仮想化技術を使用してアプリケーションを実行するためのプラットフォームであり、今日のソフトウェア開発において不可欠なツールの1つです。',
    id: '14',
    slug: 'beginners-guide-to-docker',
    tags: ['Docker', 'コンテナ仮想化', 'DevOps'],
    title: 'Docker入門ガイド',
  },
  {
    createdAt: '2022-02-24',
    description:
      '人工知能は、ますます重要性を増し、私たちの生活のあらゆる側面に影響を与えるようになっています。この記事では、人工知能の将来について考察しています。',
    id: '15',
    slug: 'the-future-of-artificial-intelligence',
    tags: ['人工知能', '技術の未来'],
    title: '人工知能の未来',
  },
  {
    createdAt: '2022-02-15',
    description: 'プログラミングは芸術であるという見方がある。しかし、その芸術はどのようにして生まれるのか？',
    id: '16',
    slug: 'the-art-of-programming',
    tags: ['プログラミング', '芸術', '哲学'],
    title: 'プログラミングの芸術',
  },
  {
    createdAt: '2022-02-23',
    description: 'AIは人類の最大の発明の一つと言われる。その力を知れば、未来を切り開くことができる。',
    id: '17',
    slug: 'the-power-of-ai',
    tags: ['AI', '未来', '革命'],
    title: 'AIの力',
  },
  {
    createdAt: '2022-03-01',
    description: 'ReactはWeb開発において最も人気のあるフレームワークの一つだ。その本質とは何か？',
    id: '18',
    slug: 'the-essence-of-react',
    tags: ['React', 'フロントエンド', 'Web開発'],
    title: 'Reactの本質',
  },
  {
    createdAt: '2022-03-05',
    description: 'ブロックチェーンは今やビジネスの現場で欠かせない技術となっている。その理由を探る。',
    id: '19',
    slug: 'the-rise-of-blockchain',
    tags: ['ブロックチェーン', 'ビジネス', 'テクノロジー'],
    title: 'ブロックチェーンの台頭',
  },
  {
    createdAt: '2022-03-10',
    description: 'プログラミングにおいて、デザインパターンは美しく有用なものだ。その魅力を探る。',
    id: '20',
    slug: 'the-beauty-of-design-patterns',
    tags: ['デザインパターン', 'プログラミング', '美学'],
    title: 'デザインパターンの美',
  },
  {
    createdAt: '2022-03-15',
    description: 'JavaScriptはWeb開発の世界で最も重要なプログラミング言語の一つだ。その未来にはどんな約束があるのか？',
    id: '21',
    slug: 'the-promise-of-javascript',
    tags: ['JavaScript', 'フロントエンド', 'Web開発'],
    title: 'JavaScriptの約束',
  },
];
